In [1]:
Proj. student

NameError: name 'Proj' is not defined

In [3]:
import pandas as pd
import numpy as np
import matplotlib .pyplot as plt

In [5]:
dict1={'Name':['Shrish','Shambhavi','Shreya','Shreyansh','Nikhil','Pallavi','Abhishek'],'Marks':[99,95,93,91,92,97,85],
'Gender':['Male','Female','Female','Male','Male','Female','Male']}

In [6]:
df1=pd.DataFrame(dict1)
df1

        Name  Marks  Gender
0     Shrish     99    Male
1  Shambhavi     95  Female
2     Shreya     93  Female
3  Shreyansh     91    Male
4     Nikhil     92    Male
5    Pallavi     97  Female
6   Abhishek     85    Male

In [7]:
df1.head()

        Name  Marks  Gender
0     Shrish     99    Male
1  Shambhavi     95  Female
2     Shreya     93  Female
3  Shreyansh     91    Male
4     Nikhil     92    Male

In [8]:
df1.tail()

        Name  Marks  Gender
2     Shreya     93  Female
3  Shreyansh     91    Male
4     Nikhil     92    Male
5    Pallavi     97  Female
6   Abhishek     85    Male

In [9]:
df1.describe()

           Marks
count   7.000000
mean   93.142857
std     4.561746
min    85.000000
25%    91.500000
50%    93.000000
75%    96.000000
max    99.000000

In [10]:
df1.shape

(7, 3)

In [11]:
print('number of rows',df1.shape[0])
print('number of columns',df1.shape[1])

number of rows 7
number of columns 3

In [12]:
df1.info

<bound method DataFrame.info of         Name  Marks  Gender
0     Shrish     99    Male
1  Shambhavi     95  Female
2     Shreya     93  Female
3  Shreyansh     91    Male
4     Nikhil     92    Male
5    Pallavi     97  Female
6   Abhishek     85    Male>

In [13]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [14]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [15]:
df1.describe(include='all')

          Name      Marks Gender
count        7   7.000000      7
unique       7        NaN      2
top     Shrish        NaN   Male
freq         1        NaN      4
mean       NaN  93.142857    NaN
std        NaN   4.561746    NaN
min        NaN  85.000000    NaN
25%        NaN  91.500000    NaN
50%        NaN  93.000000    NaN
75%        NaN  96.000000    NaN
max        NaN  99.000000    NaN

In [16]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [17]:
df1['Gender'].nunique()

2

In [18]:
df1['Gender'].value_counts()

Male      4
Female    3
Name: Gender, dtype: int64

# find no of students having marks betn 90 to 100.

In [19]:
df1['Marks']

0    99
1    95
2    93
3    91
4    92
5    97
6    85
Name: Marks, dtype: int64

In [20]:
df1['Marks']>=90

0     True
1     True
2     True
3     True
4     True
5     True
6    False
Name: Marks, dtype: bool

In [21]:
df1[df1['Marks']>=90]

        Name  Marks  Gender
0     Shrish     99    Male
1  Shambhavi     95  Female
2     Shreya     93  Female
3  Shreyansh     91    Male
4     Nikhil     92    Male
5    Pallavi     97  Female

In [22]:
(df1['Marks']>=90)&(df1['Marks']<=100)

0     True
1     True
2     True
3     True
4     True
5     True
6    False
Name: Marks, dtype: bool

In [23]:
df1[(df1['Marks']>=90)&(df1['Marks']<=100)]

        Name  Marks  Gender
0     Shrish     99    Male
1  Shambhavi     95  Female
2     Shreya     93  Female
3  Shreyansh     91    Male
4     Nikhil     92    Male
5    Pallavi     97  Female

In [24]:
len(df1[(df1['Marks']>=90)&(df1['Marks']<=100)])

6

In [25]:
between method

SyntaxError: invalid syntax (244662963.py, line 1)

In [26]:
df1['Marks'].between(90,100)

0     True
1     True
2     True
3     True
4     True
5     True
6    False
Name: Marks, dtype: bool

In [27]:
sum(df1['Marks'].between(90,100))

6

In [28]:
df1['Marks'].mean()

93.14285714285714

In [31]:
apply method

SyntaxError: invalid syntax (3590409048.py, line 1)

In [35]:
df1['Marks']

0    99
1    95
2    93
3    91
4    92
5    97
6    85
Name: Marks, dtype: int64

In [36]:
def Marks(x):
    return x/2

In [38]:
df1['Marks'].apply(Marks)

0    49.5
1    47.5
2    46.5
3    45.5
4    46.0
5    48.5
6    42.5
Name: Marks, dtype: float64

In [ ]:
to add half marks column in data

In [39]:
df1['Half_Marks']=df1['Marks'].apply(Marks)

In [40]:
df1

        Name  Marks  Gender  Half_Marks
0     Shrish     99    Male        49.5
1  Shambhavi     95  Female        47.5
2     Shreya     93  Female        46.5
3  Shreyansh     91    Male        45.5
4     Nikhil     92    Male        46.0
5    Pallavi     97  Female        48.5
6   Abhishek     85    Male        42.5

In [ ]:
use of lambda function

In [41]:
df1['Marks'].apply (lambda x:x/2)

0    49.5
1    47.5
2    46.5
3    45.5
4    46.0
5    48.5
6    42.5
Name: Marks, dtype: float64

In [43]:
df1['Name'].apply (len)

0    6
1    9
2    6
3    9
4    6
5    7
6    8
Name: Name, dtype: int64

# Map function

In [44]:
df1

        Name  Marks  Gender  Half_Marks
0     Shrish     99    Male        49.5
1  Shambhavi     95  Female        47.5
2     Shreya     93  Female        46.5
3  Shreyansh     91    Male        45.5
4     Nikhil     92    Male        46.0
5    Pallavi     97  Female        48.5
6   Abhishek     85    Male        42.5

In [45]:
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    1
Name: Gender, dtype: int64

In [51]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [52]:
df1

        Name  Marks  Gender  Half_Marks  Male_Female
0     Shrish     99    Male        49.5            1
1  Shambhavi     95  Female        47.5            0
2     Shreya     93  Female        46.5            0
3  Shreyansh     91    Male        45.5            1
4     Nikhil     92    Male        46.0            1
5    Pallavi     97  Female        48.5            0
6   Abhishek     85    Male        42.5            1

# Drop column

In [54]:
df1.drop('Male_Female',axis=1)

        Name  Marks  Gender  Half_Marks
0     Shrish     99    Male        49.5
1  Shambhavi     95  Female        47.5
2     Shreya     93  Female        46.5
3  Shreyansh     91    Male        45.5
4     Nikhil     92    Male        46.0
5    Pallavi     97  Female        48.5
6   Abhishek     85    Male        42.5

In [80]:
df1.drop(['Gender','Half_Marks','Male_Female'],axis=1,inplace=True)

KeyError: "['Gender', 'Half_Marks', 'Male_Female'] not found in axis"

In [77]:
df1

        Name  Marks
0     Shrish     99
1  Shambhavi     95
2     Shreya     93
3  Shreyansh     91
4     Nikhil     92
5    Pallavi     97
6   Abhishek     85

In [78]:
df1.columns

Index(['Name', 'Marks'], dtype='object')

In [58]:
df1.index

RangeIndex(start=0, stop=7, step=1)

# Sort datafarame as per marks column

In [79]:
df1.sort_values(by='Marks',ascending=False)

        Name  Marks
0     Shrish     99
5    Pallavi     97
1  Shambhavi     95
2     Shreya     93
4     Nikhil     92
3  Shreyansh     91
6   Abhishek     85

In [64]:
df1.sort_values(by=['Marks','Name'],ascending=False)

        Name  Marks
0     Shrish     99
5    Pallavi     97
1  Shambhavi     95
2     Shreya     93
4     Nikhil     92
3  Shreyansh     91
6   Abhishek     85

# Display name & marks of female students only.

In [65]:
df1

        Name  Marks
0     Shrish     99
1  Shambhavi     95
2     Shreya     93
3  Shreyansh     91
4     Nikhil     92
5    Pallavi     97
6   Abhishek     85

In [75]:
df1['Gender']

KeyError: 'Gender'